In [7]:
# User Defined function

def add_num(a , b):
    print(a)
    print(b)
    global result
    result = a + b
    print("Result is", result)

In [9]:
result # is local variable its scope is only within the function so it shows the error if u want to print for that u have to assing the result as global as shown in coding

33

In [11]:
def calculation(num1 , num2):
    """ This program prints the sum, product and 
    the squre of both number"""
    global sum1, prod
    sum1 = num1 + num2 
    prod = num1 * num2
    squ1 = num1 * num1
    squ2 = num2 * num2
    print(sum1)
    print(prod)
    print(squ1)
    print(squ2)

In [13]:
calculation( 11 , 22)

33
242
121
484

In [6]:
import pandas as pd

In [63]:
# file_path / file_name / file_type

cr = pd.read_csv("CreditRisk.csv")

In [16]:
cr.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0.0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1.0,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0.0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0.0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0.0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [17]:
cr.tail()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
976,LP002971,Male,Yes,4.0,Not Graduate,Yes,4009,1777.0,113.0,360.0,1.0,Urban,Y
977,LP002975,Male,Yes,0.0,Graduate,No,4158,709.0,115.0,360.0,1.0,Urban,Y
978,LP002980,Male,No,0.0,Graduate,No,3250,1993.0,126.0,360.0,NaN,Semiurban,Y
979,LP002986,Male,Yes,0.0,Graduate,No,5000,2393.0,158.0,360.0,1.0,Rural,N
980,LP002989,Male,No,0.0,Graduate,Yes,9200,0.0,98.0,180.0,1.0,Rural,Y

In [11]:
cr.shape  # shows no. of rows and columns

(981, 13)

In [12]:
cr.columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [14]:
# Select the columns 

cr.Gender  # or we can use cr[Gender]

0      Male
1      Male
2      Male
3      Male
4      Male
       ...
976    Male
977    Male
978    Male
979    Male
980    Male
Name: Gender, Length: 981, dtype: object

In [15]:
cr.ApplicantIncome.mean()

5179.795107033639

In [18]:
cr.ApplicantIncome.std()

5695.104532539108

In [20]:
cr.Gender.value_counts() # Table function

Male      775
Female    182
Name: Gender, dtype: int64

In [21]:
cr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 981 entries, 0 to 980
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            981 non-null    object
 1   Gender             957 non-null    object
 2   Married            978 non-null    object
 3   Dependents         956 non-null    float64
 4   Education          981 non-null    object
 5   Self_Employed      926 non-null    object
 6   ApplicantIncome    981 non-null    int64
 7   CoapplicantIncome  981 non-null    float64
 8   LoanAmount         954 non-null    float64
 9   Loan_Amount_Term   961 non-null    float64
 10  Credit_History     902 non-null    float64
 11  Property_Area      981 non-null    object
 12  Loan_Status        981 non-null    object
dtypes: float64(5), int64(1), object(7)
memory usage: 99.8+ KB

In [23]:
cr.describe(include="all")

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
count,981,957,978,956.000000,981,926,981.000000,981.000000,954.000000,961.000000,902.000000,981,981
unique,981,2,2,NaN,2,2,NaN,NaN,NaN,NaN,NaN,3,2
top,LP001754,Male,Yes,NaN,Graduate,No,NaN,NaN,NaN,NaN,NaN,Semiurban,Y
freq,1,775,631,NaN,763,807,NaN,NaN,NaN,NaN,NaN,349,712
mean,NaN,NaN,NaN,0.881799,NaN,NaN,5179.795107,1601.916330,142.511530,342.201873,0.835920,NaN,NaN
std,NaN,NaN,NaN,1.255623,NaN,NaN,5695.104533,2718.772806,77.421743,65.100602,0.370553,NaN,NaN
min,NaN,NaN,NaN,0.000000,NaN,NaN,0.000000,0.000000,9.000000,6.000000,0.000000,NaN,NaN
25%,NaN,NaN,NaN,0.000000,NaN,NaN,2875.000000,0.000000,100.000000,360.000000,1.000000,NaN,NaN
50%,NaN,NaN,NaN,0.000000,NaN,NaN,3800.000000,1110.000000,126.000000,360.000000,1.000000,NaN,NaN
75%,NaN,NaN,NaN,2.000000,NaN,NaN,5516.000000,2365.000000,162.000000,360.000000,1.000000,NaN,NaN
max,NaN,NaN,NaN,4.000000,NaN,NaN,81000.000000,41667.000000,700.000000,480.000000,1.000000,NaN,NaN

In [24]:
cr.isnull().sum()  # Gives the null sum for each and every column

Loan_ID               0
Gender               24
Married               3
Dependents           25
Education             0
Self_Employed        55
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           27
Loan_Amount_Term     20
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [25]:
cr.Gender = cr.Gender.fillna("Male")

In [26]:
cr.isnull().sum()  # isnull and isna are same

Loan_ID               0
Gender                0
Married               3
Dependents           25
Education             0
Self_Employed        55
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           27
Loan_Amount_Term     20
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [27]:
cr.Married.fillna("Yes", inplace = True)

In [28]:
cr.Married = cr.Married.fillna("Yes")    # code using previous line and this line are same output

In [29]:
cr.isnull().sum()

Loan_ID               0
Gender                0
Married               0
Dependents           25
Education             0
Self_Employed        55
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           27
Loan_Amount_Term     20
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [30]:
cr.Dependents = cr.Dependents.fillna(0)
cr.Self_Employed = cr.Self_Employed.fillna("Yes")
cr.LoanAmount = cr.LoanAmount.fillna(cr.LoanAmount.mean())
cr.Loan_Amount_Term = cr.Loan_Amount_Term.fillna(cr.Loan_Amount_Term.mean())
cr.Credit_History  = cr.Credit_History.fillna(0)

In [31]:
cr.isnull().sum()

Loan_ID              0
Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64

In [32]:
# if i want to create a data frame based on condition
# Where people are earning more than 3000

cr.ApplicantIncome > 3000

0       True
1       True
2      False
3      False
4       True
       ...
976     True
977     True
978     True
979     True
980     True
Name: ApplicantIncome, Length: 981, dtype: bool

In [33]:
cr.ApplicantIncome > 3000

700

In [34]:
cr1= cr[cr.ApplicantIncome > 3000]

In [36]:
cr1.shape

(700, 13)

In [42]:
# create a dataframe where income is more than 3000 , person is Graduate and male

cr2 = cr[ (cr.ApplicantIncome > 3000) & (cr.Education == "Graduate") & (cr.Gender == "Male")]

In [43]:
cr2.shape

(469, 13)

In [45]:
cr.groupby("Gender").ApplicantIncome.median()

Gender
Female    3634.5
Male      3859.0
Name: ApplicantIncome, dtype: float64

In [46]:
cr.groupby("Education").ApplicantIncome.mean()

Education
Graduate        5602.440367
Not Graduate    3700.536697
Name: ApplicantIncome, dtype: float64

In [48]:
cr.groupby(["Education", "Gender"]).ApplicantIncome.mean()

Education     Gender
Graduate      Female    4598.175676
              Male      5844.117073
Not Graduate  Female    3852.676471
              Male      3672.423913
Name: ApplicantIncome, dtype: float64

In [49]:
cr.groupby("Education").ApplicantIncome.agg(["mean","median","max","min","count"]) # agg = aggregate

                     mean  median    max  min  count
Education
Graduate      5602.440367    4000  81000    0    763
Not Graduate  3700.536697    3333  18165    0    218

In [50]:
# Renaming of the columns 

cr.rename(columns = {"ApplicantIncome" : "AapInc"}, inplace = True)

In [52]:
cr.head(1)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,AapInc,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0.0,Graduate,No,5849,0.0,142.51153,360.0,1.0,Urban,Y

In [53]:
cr.rename(columns = {"Self_Employed" : "Self_emp", "Loan_Amount_Term":"LAT"}, inplace = True)

In [54]:
cr.head(1)

,Loan_ID,Gender,Married,Dependents,Education,Self_emp,AapInc,CoapplicantIncome,LoanAmount,LAT,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0.0,Graduate,No,5849,0.0,142.51153,360.0,1.0,Urban,Y

In [55]:
cr.rename(columns={cr.columns[1]:"Gen"},inplace = True)

In [56]:
cr.head(1)

,Loan_ID,Gen,Married,Dependents,Education,Self_emp,AapInc,CoapplicantIncome,LoanAmount,LAT,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0.0,Graduate,No,5849,0.0,142.51153,360.0,1.0,Urban,Y

In [64]:
# Replace function

cr.Gender.replace({ "Male": 0, "Female": 1},inplace = True)

In [67]:
cr.Gender

0      0.0
1      0.0
2      0.0
3      0.0
4      0.0
      ...
976    0.0
977    0.0
978    0.0
979    0.0
980    0.0
Name: Gender, Length: 981, dtype: float64

In [65]:
cr.Education.replace({"Graduate": 1,"Not Graduate": 0}, inplace = True)

In [66]:
cr.Education

0      1
1      1
2      1
3      0
4      1
      ..
976    0
977    1
978    1
979    1
980    1
Name: Education, Length: 981, dtype: int64

In [68]:
cr.Education.value_counts()

1    763
0    218
Name: Education, dtype: int64

In [22]:
from sklearn.preprocessing import LabelEncoder

In [23]:
le = LabelEncoder()

In [24]:
import pandas as pd

In [25]:
cr = pd.read_csv("C:\\Users\\hp\CreditRisk.csv")

In [26]:
cr.Dependents = cr.Dependents.fillna(0)
cr.Self_Employed = cr.Self_Employed.fillna("Yes")
cr.LoanAmount    = cr.LoanAmount.fillna(   cr.LoanAmount.mean()      )
cr.Loan_Amount_Term = cr.Loan_Amount_Term.fillna(cr.Loan_Amount_Term.mean())
cr.Credit_History  = cr.Credit_History.fillna(0)
cr.Married = cr.Married.fillna("Yes")
cr.Married.fillna("Yes", inplace = True)
cr.Gender  = cr.Gender.fillna("Male")

In [27]:
cr.isnull().sum()

Loan_ID              0
Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64

In [78]:
cr.Gender = le.fit_transform(cr.Gender)
cr.Self_Employed = le.fit_transform(cr.Self_Employed)
cr.Education = le.fit_transform(cr.Education)
cr.Married  = le.fit_transform(cr.Married)
cr.Property_Area = le.fit_transform(cr.Property_Area)

In [28]:
cr.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0.0,Graduate,No,5849,0.0,142.51153,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1.0,Graduate,No,4583,1508.0,128.00000,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0.0,Graduate,Yes,3000,0.0,66.00000,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0.0,Not Graduate,No,2583,2358.0,120.00000,360.0,1.0,Urban,Y
4,LP001008,Male,No,0.0,Graduate,No,6000,0.0,141.00000,360.0,1.0,Urban,Y

In [32]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [67]:
import pandas as pd

In [68]:
cr = pd.read_csv("C:\\Users\\hp\CreditRisk.csv")

In [69]:
cr.Dependents = cr.Dependents.fillna(0)
cr.Self_Employed = cr.Self_Employed.fillna("Yes")
cr.LoanAmount    = cr.LoanAmount.fillna(   cr.LoanAmount.mean()      )
cr.Loan_Amount_Term = cr.Loan_Amount_Term.fillna(cr.Loan_Amount_Term.mean())
cr.Credit_History  = cr.Credit_History.fillna(0)
cr.Married = cr.Married.fillna("Yes")
cr.Married.fillna("Yes", inplace = True)
cr.Gender  = cr.Gender.fillna("Male")

In [70]:
cr.isnull().sum()

Loan_ID              0
Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64

In [71]:
cr = cr.drop(["Loan_ID"], axis = 1)

In [38]:
cr[cr.select_dtypes(include=["object"]).columns] = cr[cr.select_dtypes(include=["object"]).columns].apply(le.fit_transform)

In [39]:
cr.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,1,0,0.0,0,0,5849,0.0,142.51153,360.0,1.0,2,1
1,1,1,1.0,0,0,4583,1508.0,128.00000,360.0,1.0,0,0
2,1,1,0.0,0,1,3000,0.0,66.00000,360.0,1.0,2,1
3,1,1,0.0,1,0,2583,2358.0,120.00000,360.0,1.0,2,1
4,1,0,0.0,0,0,6000,0.0,141.00000,360.0,1.0,2,1

In [ ]:
# iloc and loc are used to slice / dice of data

In [ ]:
# Gender , Dependents, ApplicantIncome, Loan_Status
# ALL rows

In [72]:
cr1 = cr.iloc[ : , [0,2,5,11]] # Here colan is given to select all rows ( all col, rows)
# iloc means index location

In [73]:
cr1.head()

  Gender  Dependents  ApplicantIncome Loan_Status
0   Male         0.0             5849           Y
1   Male         1.0             4583           N
2   Male         0.0             3000           Y
3   Male         0.0             2583           Y
4   Male         0.0             6000           Y

In [74]:
# you want to select all columns from self employed till end 
# and all rows 
cr2 = cr.iloc[ : , [4,5,6,7,8,9,10,11]]
cr2.head()

,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,No,5849,0.0,142.51153,360.0,1.0,Urban,Y
1,No,4583,1508.0,128.00000,360.0,1.0,Rural,N
2,Yes,3000,0.0,66.00000,360.0,1.0,Urban,Y
3,No,2583,2358.0,120.00000,360.0,1.0,Urban,Y
4,No,6000,0.0,141.00000,360.0,1.0,Urban,Y

In [75]:
cr3 = cr.iloc[ : , 4:11]  # Will go to till 11but not include 11th column
cr3.head()

,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,No,5849,0.0,142.51153,360.0,1.0,Urban
1,No,4583,1508.0,128.00000,360.0,1.0,Rural
2,Yes,3000,0.0,66.00000,360.0,1.0,Urban
3,No,2583,2358.0,120.00000,360.0,1.0,Urban
4,No,6000,0.0,141.00000,360.0,1.0,Urban

In [ ]:
cr4 = cr.iloc[: ,[4:11]] # will go till 11 but not include 11
cr4.head()          # Do not use internal square bracket

In [ ]:
# Gender, dependent, applicant income, loan status,
# all rows

In [42]:
cr5 = cr.loc[ : , ["Gender", "Dependents", "ApplicantIncome","Loan_Status"]]
cr5.head()

   Gender  Dependents  ApplicantIncome  Loan_Status
0       1         0.0             5849            1
1       1         1.0             4583            0
2       1         0.0             3000            1
3       1         0.0             2583            1
4       1         0.0             6000            1

In [43]:
cr.columns

Index(['Gender', 'Married', 'Dependents', 'Education', 'Self_Employed',
       'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [ ]:
# Sampling divide data into train and test

In [44]:
cr.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,1,0,0.0,0,0,5849,0.0,142.51153,360.0,1.0,2,1
1,1,1,1.0,0,0,4583,1508.0,128.00000,360.0,1.0,0,0
2,1,1,0.0,0,1,3000,0.0,66.00000,360.0,1.0,2,1
3,1,1,0.0,1,0,2583,2358.0,120.00000,360.0,1.0,2,1
4,1,0,0.0,0,0,6000,0.0,141.00000,360.0,1.0,2,1

In [46]:
cr_x = cr.iloc[ : , 0 : 11]
cr_y = cr.iloc[ : , 11]

In [49]:
from sklearn.model_selection import train_test_split

In [50]:
cr_x_train , cr_x_test, cr_y_train, cr_y_test = train_test_split( cr_x,  cr_y, test_size =0.2)

In [51]:
print(cr_x_train.shape)
print(cr_y_train.shape)
print(" - - - - - - - - -")
print(cr_x_test.shape)
print(cr_y_test.shape)

(784, 11)
(784,)
 - - - - - - - - -
(197, 11)
(197,)

In [52]:
from sklearn.linear_model import LogisticRegression

In [53]:
glm = LogisticRegression()

In [54]:
glm.fit(cr_x_train, cr_y_train)

C:\Users\hp\anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:762: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [55]:
pred = glm.predict(cr_x_test)

In [57]:
from sklearn.metrics import confusion_matrix
confusion_matrix(pred, cr_y_test)

array([[ 32,  15],
       [ 30, 120]], dtype=int64)

In [60]:
import pandas as pd
cr = pd.read_csv("C:\\Users\\hp\CreditRisk.csv")
cr.Dependents = cr.Dependents.fillna(0)
cr.Self_Employed = cr.Self_Employed.fillna("Yes")
cr.LoanAmount    = cr.LoanAmount.fillna(   cr.LoanAmount.mean()      )
cr.Loan_Amount_Term = cr.Loan_Amount_Term.fillna(cr.Loan_Amount_Term.mean())
cr.Credit_History  = cr.Credit_History.fillna(0)
cr.Married = cr.Married.fillna("Yes")
cr.Married.fillna("Yes", inplace = True)
cr.Gender  = cr.Gender.fillna("Male")

In [61]:
cr = cr.iloc[ : , 1:12]

In [62]:
cr2 = pd.get_dummies(cr)

In [63]:
cr2.head(5)

,Dependents,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Gender_Female,Gender_Male,Married_No,Married_Yes,Education_Graduate,Education_Not Graduate,Self_Employed_No,Self_Employed_Yes,Property_Area_Rural,Property_Area_Semiurban,Property_Area_Urban
0,0.0,5849,0.0,142.51153,360.0,1.0,0,1,1,0,1,0,1,0,0,0,1
1,1.0,4583,1508.0,128.00000,360.0,1.0,0,1,0,1,1,0,1,0,1,0,0
2,0.0,3000,0.0,66.00000,360.0,1.0,0,1,0,1,1,0,0,1,0,0,1
3,0.0,2583,2358.0,120.00000,360.0,1.0,0,1,0,1,0,1,1,0,0,0,1
4,0.0,6000,0.0,141.00000,360.0,1.0,0,1,1,0,1,0,1,0,0,0,1

In [64]:
cr.shape

(981, 11)

In [65]:
cr2.shape

(981, 17)

In [76]:
date_time = pd.DataFrame(      {"date" :("2018-11-28" ,"2019-10-28"     ) } )

In [77]:
date_time

         date
0  2018-11-28
1  2019-10-28

In [78]:
date_time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    2 non-null      object
dtypes: object(1)
memory usage: 144.0+ bytes

In [79]:
date_time.date = pd.to_datetime(date_time.date)  # to convert into date time format
date_time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    2 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 144.0 bytes

In [81]:
date_time.date.dt.year

0    2018
1    2019
Name: date, dtype: int64

In [80]:
date_time["date"].dt.year

0    2018
1    2019
Name: date, dtype: int64

In [82]:
date_time["date"].dt.month

0    11
1    10
Name: date, dtype: int64

In [83]:
date_time["date"].dt.day

0    28
1    28
Name: date, dtype: int64

In [84]:
date_time["date"].dt.weekday

0    2
1    0
Name: date, dtype: int64

In [85]:
date_time["date"].dt.weekofyear

0    48
1    44
Name: date, dtype: int64

In [86]:
date_time["year"] = date_time["date"].dt.year
date_time["month"] = date_time["date"].dt.month
date_time["day"] = date_time["date"].dt.day

In [87]:
date_time

        date  year  month  day
0 2018-11-28  2018     11   28
1 2019-10-28  2019     10   28

In [93]:
df_date_time  = pd.DataFrame({ "DT" : ("2018-12-28 12:24:59" , 
                                       "2019-05-9  2:10:25" ,
                                       "2019-12-31  22:10:25" ,
                                       "2017-01-01  9:01:20",
                                       "2017-07-03  22:10:25") } )

In [94]:
df_date_time.DT =  pd.to_datetime(df_date_time.DT)
df_date_time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   DT      5 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 168.0 bytes

In [96]:
df_date_time['Year']    = df_date_time.DT.dt.year
df_date_time['Month_of_Year'] =df_date_time.DT.dt.month
df_date_time['Day_of_Month'] = df_date_time.DT.dt.day
df_date_time['Hour_of_Day'] = df_date_time.DT.dt.hour
df_date_time['Minute'] = df_date_time.DT.dt.minute
df_date_time['Seconds'] = df_date_time.DT.dt.second
#df_date_time['Day_Of_Week'] = df_date_time.DT.dt.weekday_name
df_date_time['Day_Of_year'] = df_date_time.DT.dt.dayofyear

In [97]:
df_date_time

,DT,Year,Month_of_Year,Day_of_Month,Hour_of_Day,Minute,Seconds,Day_Of_year
0,2018-12-28 12:24:59,2018,12,28,12,24,59,362
1,2019-05-09 02:10:25,2019,5,9,2,10,25,129
2,2019-12-31 22:10:25,2019,12,31,22,10,25,365
3,2017-01-01 09:01:20,2017,1,1,9,1,20,1
4,2017-07-03 22:10:25,2017,7,3,22,10,25,184

In [98]:
df_date_time.DT.dt

In [100]:
invalid_time = pd.DataFrame({ "DT" : ( 
                                        "20150112",
                                        "457", 
                                        "201A/10/11",
                                        "20160919")})

In [101]:
invalid_time.DT = pd.to_datetime(invalid_time.DT , errors ="ignore")

In [102]:
invalid_time

           DT
0    20150112
1         457
2  201A/10/11
3    20160919

In [103]:
invalid_time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   DT      4 non-null      object
dtypes: object(1)
memory usage: 160.0+ bytes

In [104]:
invalid_time.DT =pd.to_datetime(invalid_time.DT , errors = "coerce") # invalid Date into null

In [105]:
invalid_time

          DT
0 2015-01-12
1        NaT
2        NaT
3 2016-09-19

In [106]:
invalid_time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   DT      2 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 160.0 bytes

In [107]:
invalid_time.DT = invalid_time.DT.fillna("20201031")

In [108]:
invalid_time

                    DT
0  2015-01-12 00:00:00
1             20201031
2             20201031
3  2016-09-19 00:00:00